import UIKit

// MARK: Homework for Lesson 2.3

//MARK: Задача 1
//Вам необходимо написать программу для оценки графиков, характеризующих движение валюты в течение дня.
//У вас есть 3 числа A, B, C и формула D=B * B - 4AC, где D — возможное движение графика.
//Если D > 0, график скорее всего продолжит направление;
//Если D < 0, график скорее всего поменяет направление;
//Если D = 0, неопределенная ситуация — нужно ждать.
//Выведите в консоль строку, указывающую движение графика, в зависимости от полученного D.
//Решите задачу тремя способами, используя if-else, тернарный оператор и switch.
//Алгоритм решения:
//Проинициализируйте переменные;
//Произведите расчет величин D;
//Используя условные конструкции, произведите расчеты;
//Выведите полученный результат в консоль, используя функцию print().
